INSERT OR IGNORE INTO devices (
    id, type, name, switch_time, current, nominal_current,
    temperature, voltage, control, cycles, failures,
    forced_bad, position, occupied, lamp
)
VALUES
    ('SW-11', 'switch', 'Стрелка 11', '3.8', '4.35', '4.45', 31, '24', 1, 2500, 0, 0, 'Плюсовое', 0, 1),
    ('SW-12', 'switch', 'Стрелка 12', '4.0', '4.47', '4.45', 32, '24', 1, 3120, 0, 0, 'Плюсовое', 0, 1),
    ('SW-13', 'switch', 'Стрелка 13', '4.1', '4.59', '4.45', 33, '24', 1, 3740, 0, 0, 'Плюсовое', 0, 1),
    ('SW-14', 'switch', 'Стрелка 14', '4.3', '4.35', '4.45', 34, '24', 1, 4360, 0, 0, 'Плюсовое', 0, 1),
    ('SW-15', 'switch', 'Стрелка 15', '3.8', '4.47', '4.45', 31, '24', 1, 4980, 0, 0, 'Плюсовое', 0, 1),
    ('SW-16', 'switch', 'Стрелка 16', '4.0', '4.59', '4.45', 32, '24', 1, 5600, 0, 0, 'Плюсовое', 0, 1),
    ('SW-17', 'switch', 'Стрелка 17', '4.1', '4.35', '4.45', 33, '24', 1, 6220, 0, 0, 'Плюсовое', 0, 1),
    ('SW-18', 'switch', 'Стрелка 18', '4.3', '4.47', '4.45', 34, '24', 1, 6840, 0, 0, 'Плюсовое', 0, 1),
    ('TC-01', 'track', 'Участок 01', NULL, '0.22', '.25', 29, '2.8', 1, 1000, 0, 0, '—', 0, 1),
    ('TC-02', 'track', 'Участок 02', NULL, '0.26', '.25', 30, '2.9', 1, 1350, 0, 0, '—', 0, 1),
    ('TC-03', 'track', 'Участок 03', NULL, '0.30', '.25', 31, '3.0', 1, 1700, 0, 0, '—', 0, 1),
    ('TC-04', 'track', 'Участок 04', NULL, '0.22', '.25', 29, '2.8', 1, 2050, 0, 0, '—', 0, 1),
    ('TC-05', 'track', 'Участок 05', NULL, '0.26', '.25', 30, '2.9', 1, 2400, 0, 0, '—', 0, 1),
    ('TC-06', 'track', 'Участок 06', NULL, '0.30', '.25', 31, '3.0', 1, 2750, 0, 0, '—', 0, 1),
    ('SG-01', 'signal', 'Светофор 01', NULL, '0.42', '.45', 30, '24.0', 1, 1800, 0, 0, 'Красный', 0, 1),
    ('SG-02', 'signal', 'Светофор 02', NULL, '0.45', '.45', 31, '25.0', 1, 2200, 0, 0, 'Красный', 0, 1),
    ('SG-03', 'signal', 'Светофор 03', NULL, '0.48', '.45', 32, '26.0', 1, 2600, 0, 0, 'Красный', 0, 1),
    ('SG-04', 'signal', 'Светофор 04', NULL, '0.42', '.45', 33, '24.0', 1, 3000, 0, 0, 'Красный', 0, 1),
    ('SG-05', 'signal', 'Светофор 05', NULL, '0.45', '.45', 30, '25.0', 1, 3400, 0, 0, 'Красный', 0, 1),
    ('SG-06', 'signal', 'Светофор 06', NULL, '0.48', '.45', 31, '26.0', 1, 3800, 0, 0, 'Красный', 0, 1);
